УТ_для_edt/src/Catalogs/смартОборудованиеКлиентов/смартОборудованиеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартОборудованиеКлиентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>смартТипОборудованияКлиента</name>
    <type>
      <types>EnumRef.смартТипыОборудованияКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВЗаявкуНаРемонтныеРаботы</name>
    <comment>//смарт:ММ #082 397 14.01.2021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировкиДляВыгрузки</name>
    <comment>//смарт:ММ #082 397 14.01.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВЗаявкеНаПусконаладку</name>
    <comment>//смарт:ММ #094 411 05.02.2021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмартНеИспользуетЧернила</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьОсновнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПечатающихголовок</name>
    <type>
      <types>CatalogRef.смартТипыПечатающихГоловок</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>//++ #Б-1038смарт: Мосолов 23.10.2024 //Доработать календарь загрузки инженеров (смарт)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКвалификациюИнженеров</name>
    <comment>#Б-2770 смарт: Лопато 26.03.2025 //Создание механизма учета квалификации инженеров СЦ.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОценки</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификацияОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/смартТипыОборудованияКлиента/смартТипыОборудованияКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыОборудованияКлиента</name>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>Чернила</name>
  </enumValues>
  <enumValues>
    <name>Бумага</name>
  </enumValues>
  <enumValues>
    <name>РИП</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартОборудованиеКлиентов/Forms/ФормаОборудованиеКлиента/Module.bsl
&НаКлиенте
Процедура Добавить(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Добавить оборудование");
	Кнопки.Добавить(КодВозвратаДиалога.Нет, "Вернуться назад");

	ТекстВопроса = НСтр("ru = 'Перед выбором убедитесь, что оборудования, которое вы хотите добавить, нет в списке'");

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросДобавитьОборудование", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 0,, "Добавление оборудования клиента");

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросДобавитьОборудование(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РасшСмарт_ОткрытьФормуВыбораОборудования();
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура РасшСмарт_ОткрытьФормуВыбораОборудования()
	
	ПараметрЗаголовок = НСтр("ru = 'Добавление оборудования для %Справочник%'");
	Если ЗначениеЗаполнено(Партнер) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", Партнер);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Справочник%", НСтр("ru='(новый клиент)'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаДобавления", 	Дата(ТекущаяДата()));
	ПараметрыФормы.Вставить("Партнер", 			Партнер);
	  
	ПараметрыФормы.Вставить("смартТипОборудованияКлиента", ПредопределенноеЗначение("Перечисление.смартТипыОборудованияКлиента.Оборудование"));
	
	ПараметрыТовара = ПараметрыТаблицыОборудование();
	
	ОткрытьФорму("Справочник.Партнеры.Форма.РасшСмарт_ФормаДобавленияОборудования", 
				ПараметрыФормы, 
				ЭтаФорма, 
				УникальныйИдентификатор,
				,
				,
				Новый ОписаниеОповещения("ДобавитьОборудованиеКлиентаПослеВыбора", ЭтотОбъект, ПараметрыТовара),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОборудованиеКлиентаПослеВыбора(ПодобранноеОборудование, ДополнительныеПараметры) Экспорт 
	
	Если ПодобранноеОборудование = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьОборудованиеКлиентаЗавершение(ДополнительныеПараметры, ПодобранноеОборудование);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОборудованиеКлиентаЗавершение(ПараметрыОборудования, НовыеСтроки)

	//++ #5306 смарт: Тимофеева 20.01.26 / Cписок оборудования клиента в карточке клиента
	//Отбор = Новый Структура("смартОборудованиеКлиента");
	//
	//Для каждого НоваяСтрока Из НовыеСтроки Цикл
	//	
	//	ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
	//	                  
	//	РезультатПоиска = ТаблицаОборудования.НайтиСтроки(Отбор);
	//	
	//	Если РезультатПоиска.Количество() = 0 Тогда
	//		
	//		ТекущаяСтрока = ТаблицаОборудования.Добавить();
	//		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Отбор);
	//		ТекущаяСтрока.смартДатаДобавления = Дата(ТекущаяДата());
	//		ТекущаяСтрока.смартКомментарий = НоваяСтрока.смартКомментарий; 
	//		
	//		Если НовыеСтроки.Количество() > 0 Тогда
	//			Элементы.ТаблицаОборудования.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Это оборудование уже добавлено");
	//	КонецЕсли;
	//				
	//КонецЦикла; 
	
	Для каждого НоваяСтрока Из НовыеСтроки Цикл
		ТекущаяСтрока = ТаблицаОборудования.Добавить();
		ТекущаяСтрока.смартОборудованиеКлиента 	= НоваяСтрока.смартОборудованиеКлиента;
        ТекущаяСтрока.смартДатаДобавления 		= Дата(ТекущаяДата());
		ТекущаяСтрока.смартКомментарий 			= НоваяСтрока.смартКомментарий; 
		ТекущаяСтрока.смартИдентификатор 		= Строка(Новый УникальныйИдентификатор); 
		
		Элементы.ТаблицаОборудования.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор(); 	
	КонецЦикла; 
	//-- #5306 смарт: Тимофеева 20.01.26	
	
КонецПроцедуры

&НаСервере
Функция ПараметрыТаблицыОборудование()

	ПараметрыТаблицыОборудование = Новый Структура;
	ПараметрыТаблицыОборудование.Вставить("смартНаименованиеОборудования", "");
	ПараметрыТаблицыОборудование.Вставить("смартОборудованиеКлиента", ПредопределенноеЗначение("Справочник.смартОборудованиеКлиентов.ПустаяСсылка"));
	ПараметрыТаблицыОборудование.Вставить("смартДатаДобавления", '00010101');
	ПараметрыТаблицыОборудование.Вставить("смартКомментарий", "");
	
	Возврат ПараметрыТаблицыОборудование;

КонецФункции // ПараметрыТаблицыОборудование()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Не Параметры.Свойство("Партнер") Тогда
		Возврат;
	Конецесли;
		
	Партнер = Параметры.Партнер;
	
	ТаблицаОборудования.Загрузить(Партнер.смартОборудованиеКлиентов.Выгрузить());
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + Партнер.Наименование;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	мОбъектПартнер = Партнер.ПолучитьОбъект();
	мОбъектПартнер.смартОборудованиеКлиентов.Загрузить(ТаблицаОборудования.Выгрузить());
	
	Попытка
		
		мОбъектПартнер.Записать();
		
		ЭтаФорма.Модифицированность = Ложь;
		
		Возврат "Данные записаны";
		
	Исключение
		
		мОшибка = ОписаниеОшибки();
		
		ТекстОшибки = "Не удалось записать по причине: " + мОшибка;
		
		Возврат ТекстОшибки;
		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		РеузльтатЗаписи = ЗаписатьНаСервере();   
		
		Сообщить(РеузльтатЗаписи);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)

	смартРазрешитьРедактированиеОборудованияНаСервере();

КонецПроцедуры

&НаСервере
Процедура смартРазрешитьРедактированиеОборудованияНаСервере()
	
	Если АдминистраторСервисЦентра() Тогда
		
		Элементы.ТаблицаОборудования.ИзменятьСоставСтрок = Истина;
		Элементы.ТаблицаОборудования.ЦветФона = ЦветаСтиля.ЦветФонаПоля;  
		
		Элементы.ТаблицаОборудованиясмартНаименованиеОборудования.Доступность 	= Истина;
		Элементы.ТаблицаОборудованиясмартОборудованиеКлиента.Доступность 	= Истина;
		Элементы.ТаблицаОборудованиясмартДатаДобавления.Доступность 		= Истина;
		
		ЭтаФорма.Модифицированность = Истина;
		
	Иначе
		Сообщить("Изменение доступно не всем, обратитесь к администратору");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдминистраторСервисЦентра()

	АдминистраторСЦ = Пользователи.РолиДоступны("ПолныеПрава,смартИзменениеСоставаОборудованияПартнера");

	Возврат АдминистраторСЦ;
	
КонецФункции
